data = '[{"id" : "1", "quote" : "Nature never hurries. Atom by atom, little by little she achieves her work", "by":"Ralph Waldo Emerson"},{"id":"2","quote":"All seasons are beautiful for the person who carries happiness within.","by":" Horace Friess","category":"nature"},{"id":"3","quote":"Whoever loves and understands a garden will find contentment within.","by":"Chinese Proverb","category":"nature"},{"id":"4","quote":"Nature does not hurry, yet everything is accomplished.","by":"Lao Tzu","category":"nature"},{"id":"5","quote":"In my garden, after a rainfall, you can faintly, yes, hear the breaking of new blooms.","by":"Truman Capote","category":"nature"},{"id":"6","quote":"I think it annoys God if you walk by the color purple in a field and don&rsquo;t notice.","by":"Alice Walker","category":"nature"},{"id":"7","quote":"Each season has its own wonder, its own special place, and purpose in the pattern of creation.","by":"Unknown","category":"nature"},{"id":"8","quote":"Flowers are heavens masterpiece.","by":"Dorothy Parker","category":"nature"},{"id":"9","quote":"The landscape belongs to the person who looks at it.","by":"Ralph Waldo Emerson","category":"nature"},{"id":"10","quote":"The silence of nature is very real. It surrounds you . . . you can feel it.","by":"Ted Truebloods","category":"nature"},{"id":"11","quote":"Each moment of the year has its own beauty . . . a picture which was never before and shall never be seen again.","by":"Ralph Waldo Emerson","category":"nature"},{"id":"12","quote":"After a thundershower, the weather takes a pledge and signs it with a rainbow.","by":"Thomas Bailey Aldrich","category":"nature"},{"id":"13","quote":"The earth laughs in flowers.","by":"Ralph Waldo Emerson","category":"nature"},{"id":"14","quote":"Doubt whom you will, but never yourself.","by":"Christian Nestell Bovee","category":"inspirational"},{"id":"15","quote":"Every artist was first an amateur.","by":"Ralph Waldo Emerson","category":"inspirational"},{"id":"16","quote":"Nothing is worth more than this day. You cannot relive yesterday. Tomorrow is still beyond our reach..","by":"Johann Wolfgang Von Goethe","category":"inspirational"},{"id":"17","quote":"I was always looking outside myself for strength and confidence, but it comes from within. It is there all of the time.","by":"Anna Freud","category":"inspirational"},{"id":"18","quote":"In any project the important factor is your belief. Without belief, there can be no successful outcome.","by":"William James","category":"inspirational"},{"id":"19","quote":"Do not wait; the time will never be just right. Start where you stand.","by":"Napoleon Hill","category":"inspirational"},{"id":"20","quote":"Experience is the child of thought, and thought is the child of action.","by":"Benjamin Disraeli","category":"inspirational"},{"id":"21","quote":"We are all faced with a series of great opportunities - brilliantly disguised as insoluable problems.","by":"John Gardner","category":"inspirational"},{"id":"22","quote":"First say to yourself what you would be; and then do what you have to do..","by":"Epictetus","category":"inspirational"},{"id":"23","quote":"If you have built castles in the air, your work need not be lost; that is where they should be. Now put foundations under them.","by":"Henry David Thoreau","category":"inspirational"},{"id":"24","quote":"If people say they just love the smell of books, I always want to pull them aside and ask, To be clear, do you know how reading works?","by":"Bridger Winegar","category":"funny"},{"id":"25","quote":"Nature abhors a vacuum, but not as much as a cat does.","by":"Anonymous","category":"funny"},{"id":"26","quote":"If con is the opposite of pro, then isn&rsquo;t Congress the opposite of progress?","by":"Jon Stewart","category":"funny"},{"id":"27","quote":"Don&rsquo;t know where your kids are in the house? Turn off the internet and they&rsquo;ll show up quickly.","by":"Anonymous","category":"funny"},{"id":"28","quote":"Out of all the lies I&rsquo;ve told, &ldquo;Just kidding!&rdquo; is my favorite.","by":"Unknown","category":"funny"},{"id":"29","quote":"It&rsquo;s useless to hold a person to anything they say when they are in love, drunk, or running for office.","by":"Shirley MacLaine","category":"funny"},{"id":"30","quote":"A celebrity is a person who works hard all his life to become well known, then wears dark glasses to avoid being recognized.","by":"Fred Allen","category":"funny"},{"id":"31","quote":"If debugging is the process of removing software bugs, then programming must be the process of putting them in.","by":"Edsger Dijkstra","category":"developer"},{"id":"32","quote":"Measuring programming progress by lines of code is like measuring aircraft building progress by weight.","by":"Bill Gates","category":"developer"},{"id":"33","quote":"Always code as if the guy who ends up maintaining your code will be a violent psychopath who knows where you live.","by":"Martin Golding","category":"developer"},{"id":"34","quote":"C makes it easy to shoot yourself in the foot; C++ makes it harder, but when you do, it blows away your whole leg.","by":"Bjarne Stroustrup","category":"developer"},{"id":"35","quote":"If debugging is the process of removing software bugs, then programming must be the process of putting them in.","by":"Edsger Dijkstra","category":"developer"},{"id":"36","quote":"Before software can be reusable it first has to be usable.","by":"Ralph Johnson","category":"developer"},{"id":"37","quote":"A good programmer is someone who always looks both ways before crossing a one-way street.","by":"Doug Linder","category":"developer"},{"id":"38","quote":"There are only two kinds of programming languages: those people always bitch about and those nobody uses.","by":"Bjarne Stroustrup","category":"developer"},{"id":"39","quote":"The best performance improvement is the transition from the nonworking state to the working state.","by":"J. Osterhout","category":"developer"},{"id":"40","quote":"I don&rsquo;t care if it works on your machine! We are not shipping your machine!.","by":"Vidiu Platon","category":"developer"},{"id":"41","quote":"I&rsquo;ve finally learned what &rsquo;upward compatible&lsquo; means. It means we get to keep all our old mistakes.","by":"Dennie van Tassel","category":"developer"},{"id":"42","quote":"The trouble with programmers is that you can never tell what a programmer is doing until it&rsquo;s too late.","by":"Seymour Cray","category":"developer"},{"id":"43","quote":"First learn computer science and all the theory.  Next develop a programming style.  Then forget all that and just hack.","by":"George Carrette","category":"developer"},{"id":"44","quote":"To iterate is human, to recurse divine.","by":"L. Peter Deutsch","category":"developer"},{"id":"45","quote":"Computer language design is just like a stroll in the park.  Jurassic Park, that is.","by":"Larry Wall","category":"developer"},{"id":"46","quote":"The first 90% of the code accounts for the first 90% of the development time. The remaining 10% of the code accounts for the other 90% of the development time.","by":"Tom Cargill","category":"developer"},{"id":"47","quote":"You can&rsquo;t have great software without a great team, and most software teams behave like dysfunctional families.","by":"Jim McCarthy","category":"developer"},{"id":"48","quote":"There are only 10 types of people in the world: Those who understand binary, and those who don&rsquo;t.","by":"Unknown","category":"developer"},{"id":"49","quote":"Don&rsquo;t get suckered in by the comments. They can be terribly misleading. Debug only code.","by":"Dave Storer","category":"developer"},{"id":"50","quote":"There are two ways of constructing a software design. One way is to make it so simple that there are obviously no deficiencies. And the other way is to make it so complicated that there are no obvious deficiencies.","by":"C.A.R. Hoare","category":"developer"}]';